In [ ]:
# Run python -m pip install pymysql from your terminal to install pymysql.

In [ ]:
# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

In [ ]:
# 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

In [ ]:
# 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

In [ ]:
# 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return 
# a url connection string formatted like in the example at the start of this lesson.

In [1]:
import numpy as np
import pandas as pd

host = 'data.codeup.com'
username = 'tobias_2308'
password = 'ih1LPzX44btoIImWWG5Y1WWvPjYfKhYA'

def get_db_url(database_name):
    """
    This function takes in a string database name and returns the url connection.
    """
    url = f'mysql+pymysql://{username}:{password}@{host}/{database_name}'

    return url

In [ ]:
# 4. Use your function to obtain a connection to the employees database.

In [2]:
url = get_db_url('employees')

In [3]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [57]:
from sqlalchemy import text, create_engine

engine = create_engine(url)

query = text('SELECT * FROM employees LIMIT 5 OFFSET 50')

pd.read_sql(query, engine.connect())

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [ ]:
# 5. Once you have successfully run a query:
#     a. Intentionally make a typo in the database url. What kind of error message do you see?

# I did not see an error.

In [63]:
url = get_db_url('employees')
#url

In [ ]:
#     b.  Intentionally make an error in your SQL query. What does the error message look like?

# NoSuchModuleError

In [ ]:
# 6. Read the employees and titles tables into two separate DataFrames.

In [23]:
titles = pd.read_sql('SELECT * FROM titles', url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [24]:
employees = pd.read_sql('SELECT * FROM employees', url)
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [ ]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

#  There are 443,308 rows with four columns in Titles and 300,024 rows with six columns in Employees.

In [30]:
employees.shape

(300024, 6)

In [31]:
titles.shape

(443308, 4)

In [ ]:
# 8. Display the summary statistics for each DataFrame.

In [27]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [28]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [ ]:
# 9. How many unique titles are in the titles DataFrame?

In [32]:
titles.title.nunique()

7

In [ ]:
# 10. What is the oldest date in the to_date column?

In [33]:
titles.to_date.min()

datetime.date(1985, 3, 1)

In [ ]:
# 11. What is the most recent date in the to_date column?

In [34]:
titles.to_date.max()

datetime.date(9999, 1, 1)